{"license":"","file_hash":null,"name":"Genius Loci","version":"2019.1.14","description":"Genius Loci is a set of custom nodes for exporting from Revit and automating tasks.\r\nThe main goal is to interact with linked files and Revit documents collected from directories.\r\nThe nodes have been tested with Dynamo 2.0\r\n\r\nSome nodes in other packages have been modified to work with linked Revit files.\r\nThanks to the original authors for their great script.\r\n\r\ngeniusloci.bim@gmail.com\r\n\r\n2019.1.14 Added Create Compound System FamilyType, Get SystemType Properties, Set SketchPlane By Line, Element Top and Bottom References and Element Pattern Reference nodes.\r\n2019.01.01 Added FamilyInstance Reference, FamilyInstance ReferenceType, Wall Layer References, Element Reference, and Dimension By References nodes.\r\n2018.12.17 Added Wall CompoundStructureLayersLocation and Tag Set Location nodes.\r\nUpdated Create Line Pattern.\r\n2018.12.09 Updated Tag Get tagged Element node (it now works with tags on linked elements and linked rooms)Added View Range and Create Line Pattern nodes.\r\n2018.11.29 Added support for Foreground and Background Patterns (Revit 2019) in various nodes.\r\nAdded Override FillPattern in View (for Revit 2019)\r\nAdded Material Create and Add AppearanceAssetElement, Material Set Render Appearance Color and FilledRegion Color Change nodes.\r\n2018.11.22 Added 3DView Lock or Unlock, 3DView Restore Orientation, Create Sheet List Schedule, Create View List Schedule, Get Pinned Element and Get Hidden Element nodes.\r\n2018.11.02 Added View Properties, Collector of UserWorksets, Collector of Detail Items Types, and Tag Get tagged Element nodes. Updated SelectByCategoryAnd3DView node.\r\n2018.10.20 Added Display Units, ReportRevitLinks and Reload Revit Links.\r\n2018.10.16 Adding nodes to create Material, to set Rendering Color and Tint Color, to change Texture Path and to Get and Set Appearance Asset.\r\n2018.10.09 Added Railing SetPath\r\nAdded Get/ Set and Create DWG Export Setup nodes\r\nAdded Purge Unused\r\n2018.10.02  Added Get Elements Overrides\r\n2018.09.16  Added Reload CADLinks\r\nUpdated Print PDF in document\r\n2018.09.05 Added Get Phase Map\r\nAdded Collector of FillPatternElement\r\nAdded FilledRegion Pattern Change\r\nAdded Enumerate Datum Extent Type\r\nAdded Switch between 2D or 3D extent\r\n2018.08.27 Added the ability to tag linked elements to the node Create Independent Tag.\r\nAdded Tag Is Orphaned\r\nAdded Get Phase Filter Presentation\r\nAdded Get Phase Filter\r\n2018.08.06 Added Get Material Properties and View_Get Color of Filter nodes\r\n2018.8.01 Add SetParameterByName in document\r\nImprovement for the nodes CollectorPlacedViews.\r\n2018.7.15 Added Collector of PlacedViews\r\nAdded Get all views\r\n2018.7.11 Added SelectByCategoryAndHost3DView\r\nAdded SelectByCategoryAndBoundingBox\r\n2018.6.18 Updated Set3DViewOrientation and 3DViewToBoundingBox\r\n2018.6.05 Added Elements Delete in document\r\nAdded Get Shared Parameter\r\n2018.5.22 Added the Project Origin option to the Export IFC nodes\r\nAdded Get ScheduleView node\r\nAdded two nodes to unload and reload LinkInstance","group":"","keywords":["export","pdf","dwg","dwf","ifc","nwc","print","merge","reload","unload","repath","cadlink","revitlink","linked","3dview","logo","mep","room","space","workset","sketchplane","system","subcategory","ansi","viewfilter","tag","level","grid","color","material","asset","texture","filledregion","fillpattern","phase","graphics","compound","reference","overrides","purge","railing","unfold","worksharing","tooltip","acquire","coordinate","point","pinned","hidden","lock"],"dependencies":[],"contents":"3DView by BoundingBox - Use a boundingbox to create a new 3D View with a specified name and a section box.\r\nInspired by archilab, 3DView Lock or Unlock - Use a boolean True to unlock the 3D view. \r\nFalse locks the 3D view and saves its orientation., 3DView Restore Orientation - Locks the view and restores its orientation.\r\nThe 3D view must have been locked once., 3DView Set Orientation - This node will copy the orientation from the desired 3D view and apply it to a list of 3D views.\r\nThe 3D views will be locked.\r\nThe name of the 3D view mustn't include any special characters  \\ : {} etc.\r\nBased on a Ben Osborne's script., 3DView To BoundingBox - Extract section boxes from desired 3D views, and convert them into bounding box element.\r\nBased on Amy Williams's script., Acquire Coordinates - Works only in Revit 2018 and later.\r\nAcquires coordinates from the specified link instance (RevitLinkInstance or DWG ImportInstance).\r\nThe geolocation information will be pulled from the linked model to the host model., All Elements of Types in Document - Collect all elements of a type in a given document., Collector AppearanceAssetElement - Retrieves all the Appearance Asset Elements in the model., Collector of Detail Items Types - Retrieves all the Detail Items Family Types in the model., Collector of FillPatternElement - Collect Fill Pattern Elements and separate the pattern types between Drafting and Model., Collector of Levels - Collects Levels in the active or given document.\r\nFrom Lunchbox, Collector of PlacedViews - This node will collect all views placed on sheets in the active or given document., Collector of Printsettings - Collects printsettings and their names in the active or given document.\r\nInspired by archilab, Collector of UserWorksets - Retrieves the UserWorksets and their proprieties in the active or given document., Collector of ViewSheetSets - Retrieve all available View Sets in the active or given document.\r\nUse with ViewSheetSet.Views from Clockwork package.\r\nInspired by archilab., Convert Point in Coordinate Systems - Get location point in the 3 coordinate systems : Shared Coordinates, Project Coordinates, Relative Origin Coordinates.\r\nBased on a Daniel Woodcock's script., Convert text file - Convert exported schedules from format Unicode to ANSI (or utf_8), Create Annotation Tag (Multi-Category) - Note : This method is deprecated in Revit 2019.\r\nThis node will create an annotation tag at a given location, of given type and in a supplied view. If only single view is supplied then all tags will be created in that view. \r\nMulti Category tag and Material Tag have been added to the original node.\r\nFrom archilab, Create DWG Export Setup - Create a DWG export settings with values of the given DWGExportOptions., Create Independent Tag - Works only in Revit 2018 and later.\r\nThis node will create an annotation tag at a given location, of given type and in a supplied view. If only single view is supplied then all tags will be created in that view. \r\nThe node works also with Linked Elements, Multi Category tag and Material Tag.\r\nFrom archilab, Create Line Pattern - Creates a new LinePatternElement.\r\nA line pattern is made of dashes, dots alternating with spaces. A space must end the sequence., Create Material - Note : This method is deprecated in Revit 2019.\r\nCreate new materials or overwrite properties of existing materials.\r\nInspired by Dynamo Forum., Create Sheet List Schedule - Create a Sheet List Schedule with Sheet Number, Sheet Name, Current Revision and Current Revision Date., Create View List Schedule - Create a View List Schedule with View Name, View Template, Sheet Number and Sheet Name fields., Delete Elements in Document - Delete the input list of elements from the given Revit document.\r\nThe node returns the number of successfully deleted elements and their Ids as a string.\r\nFrom Springs, Dimension By References - Creates a new linear dimension from at least two element references., Display Units - Enumerate the UnitTypes and the UnitGroups and returns their DisplayUnitTypes and UnitSymbols associated., Document SaveAs - Saves the given Revit document under the given name.\r\nFrom Clockwork, Duplicate AppearanceAssetElement - Works only in Revit 2018.1 and later.\r\nDuplicate an Appearance Asset Element., Element Curve - Get the curve from the element., Element Reference - Gets a reference of a geometric object., Elements From Linked File in Space - This node will check what elements from a linked model are inside of any of the spaces in the current model.\r\nFrom archilab, Enumerate Datum Extent Type - Enumerate Datum Extent Type : Model (3D extent) or ViewSpecific (2D extent).\r\nUse with \"Switch between 2D or 3D extent\" node., Enumerate DWG export options - Enumerate Color mode, Autocad Version and Type of Units., Enumerate DWG import options - Enumerate Color mode, Type of Placement and Type of Unit.\r\nWork with node \"Import DWG\"., Enumerate Naviswork Coordinates and Exportscope - Work with node \"Export NWC from directory\".\r\nFrom Bakery, Export DWFx in Document - Export Views to DWFx file from document, Export DWG in Document - Export views to DWG file from document with export setup.\r\nFrom archilab, Export DWG - Export views to DWG file with export setup.\r\nFrom archilab, Export IFC in Document - Export Views to IFC file from document.\r\nThe Project Origin option works only with Revit 2018 and above.\r\nSome other IFC options are embedded inside the python script., Export IFC - Export Views to IFC file.\r\nThe Project Origin option works only with Revit 2018 and above.\r\nSome other IFC options are embedded inside the python script., Export NWC in Document - !! This node needs Navisworks Exporters for Revit to export NWC.\r\nThis node exports Views to NWC files from from document.\r\nNavisworks options are embedded inside the python script., FamilyInstance Reference - Works only in Revit 2018.1 and later.\r\nGets family instance references corresponding to the reference planes or reference lines in the instance's family. , FamilyInstance ReferenceType - Works only in Revit 2018.1 and later.\r\nIdentifies references of family instances corresponding to reference planes and reference lines in the family., FilenameToFilePaths - Add directory and .pdf extension to filenames., FilledRegion Color Change - Change the color of a Filled Region to another given color., FilledRegionType Pattern Change - Change the pattern of a Filled Region Type to another given pattern., Get 3D views - Retrieves the 3D views in the active or given document., Get all views - Collects all views (without the sheets) in the active or given document.\r\nInspired by a Archilab's node., Get CompoundStructureLayers - Retrieves the properties of the compound layers of wall, floor, roof or ceiling Type., Get DWG Export Setup - Collect the DWGExportOptions stored in the ExportDwgSettings., Get Element Worksharing Tooltip Info - Returns worksharing informations (Creator, LastChangedBy, Owner) about element in the given document., Get Elements Overrides - Note: This method is deprecated in Revit 2019.\r\nGet the overrides applied to the elements in the given View., Get Hidden Element - Reports the hidden elements in the given view., Get Material Properties - Note : This method is deprecated in Revit 2019.\r\nGet name, color, transparency, Surface and Cut patterns id from the given material.., Get Phase Filter Presentation - Get Phase Filter Status Presentation., Get Phase Filter - Get available Phase Filters, Get Phase Map - Works only in Revit 2019 and later.\r\nThe node returns a mapping between phases in the host document and phases in the linked document., Get Pinned Element - Identify the pinned elements., Get Project Locations - Works only in Revit 2018 and later.\r\nRetrieves the project positions with the survey point as the origin. \r\n(Coordinates of Internal origin, project base point and survey point), Get rooms by name or number - Enter the name or number of room to get the room.\r\nInspired by jeremy@learndynamo.com, Get ScheduleView - Get Schedule View from ScheduleSheetInstance., Get Shared Parameter - Get the parameters names, the parameters groups and the parameters types of the active shared parameter file., Get SubCategories Line Pattern - Get the Line Patterns of the subcategories for a given category.\r\nFrom Forum DynamoBim, Get View By Name - Collect views by given name in the active or given document.\r\nBased on a Daniel Woodcock's script., GetSurroundingElements in Document - Get Surrounding Elements by Categories, group them as List. Tolerance distance available in linked document.\r\nFrom SteamNodes, Import DWG - Import DWGs in views with options.\r\nUse with the Enumerate DWG import options node.\r\nBased on an archilab's script., LevelBottom - This node takes an input of the level and returns level bottom it.\r\nFrom archilab, Link DWG - Link DWGs in views with options.\r\nUse with the Enumerate DWG import options node.\r\nBased on a archilab's script., LogoGeniusLoci - Display logo Genius Loci.\r\nThe logo picture will be created in directory \r\nC:\\ProgramData\\Dynamo, Material Change Image and Edit it - Works only in Revit 2018.1 and later.\r\nThe material must already have an assigned texture.\r\nChange the image and edit its properties.\r\n(Inputs are converted in metric units.), Material Change Texture Path - Works only in Revit 2018.1 and later.\r\nThe material must already have an assigned texture., Material Create and Add AppearanceAssetElement - Works only in Revit 2018.1 and later.\r\nRequires a material called Default.\r\nDuplicates the Appearance Asset Element of the \"Default\" material, give him a chosen name, and applies it to the given material., Material Get Appearance Asset Element - Works only in Revit 2018.1 and later.\r\nRetrieves the Appearance Asset Elements of the given material and its Rendering Asset., Material Set Appearance Asset Element - Set the Appearance Asset Element of the given material., Material Set Render Appearance Color - Works only in Revit 2018.1 and later.\r\nCopies the value of the graphic color into the rendering color of the Appearance Asset Element., Material Set Render Color - Works only in Revit 2018.1 and later.\r\nSet the rendering color in the Appearance Asset Element of the given material., Material Set Tint Color - Works only in Revit 2018.1 and later.\r\nEnable the Tint Color Property and set the Tint Color in the Appearance Asset Element of the given material., New Create Material - Works only in Revit 2019 and later.\r\nCreate new materials or overwrite properties of existing materials.\r\nInspired by Dynamo Forum., New Get Elements Overrides - Works only in Revit 2019 and later.\r\nGet the overrides applied to the elements in the given View., New Get Material Properties - Works only in Revit 2019 and later.\r\nGet name, color, transparency, SurfaceForeground, SurfaceBackground, CutForeground and CutBackground patterns id from the given material., New View Get Color of Filter - Works only in Revit 2019 and later.\r\nGet the view filter and its colors from the given view., Override FillPattern in View - Works only in Revit 2019 and later.\r\nOverrides Fill Pattern of given element in a given view to specified Fill Pattern and color., Print PDF (multiple formats) - This node will allow you to initiate a printing routine from a set of views/sheets, filename, printer name, print settings with many formats and print range.\r\nUse MergePDFs node to combine files.\r\nFrom archilab., Print PDF in Document (multiple formats) - This node will allow you to initiate a printing routine from a set of views/sheets, filename, printer name, print settings with many formats and print range from document.\r\nUse MergePDFs node to combine files.\r\nFrom archilab., Purge Unused - Using the Postable Command, run the Purge Unused function., Railing SetPath - Modify the path of an existing railing., Reload CADLinks - Reload imported CAD from its current location.\r\nWorks only in Revit 2018 and later., Reload RevitLinkInstance - Reloads the Revit link provided.\r\nBased on a Einar Raknes's script., Reload RevitLinkType in Document - Reloads all Revit links in a document Revit., Repath CADLinks - Reload imported CAD from an unique folder.\r\nWorks only in Revit 2018 and above., Repath RevitLinkType - Reloads all linked Revit files from an unique folder.\r\nBased on a Nick Boyts's script., ReportRevitLinks - Inspired by Bimorph.\r\nGenerates a report of all Revit links in the document. \r\nRevit links properties are output to facilitate the Revit link model management., SelectByCategory in Document - Collect elements by category in a linked or open document in the background., SelectByCategoryAndBoundingBox - Collect elements by category from a BoundingBox., SelectByCategoryAndDesignOption - Select all elements by Design Option and category in the given document.\r\nFrom archilab, SelectByCategoryAndHost3DView - Collects elements in the given document by category and in the host 3D view of the active document.\r\nThe transform CS is returned only with a LinkInstance input., SelectByCategoryAndLevel - Select Elements by Category and Level.\r\nWith a document input, use with the Level Collector node to get the level input.\r\nInspired by archilab, SelectByCategoryAndView - Collects elements by Category and View in the given document.\r\nThe transform CS is returned only with a LinkInstance input., Set DWG Export Setup - Sets the DWGExportOptions stored in the ExportDwgSettings., Set SubCategory ProjectionLineweight - Assigns Line Weight, Line Pattern and Line Color to the Projection Lines of the specified subcategory., SetParameterByName in Document - Set the element value by name from a specific document., Switch between 2D or 3D extent - Switch the extents of grid and level from 2d to 3d or vice versa.\r\nUse with \"Enumerate Datum Extent Type\" node., SynchronizeWithCentral in Document - Synchronizes a workshared model with the central model with the choice of the Revit document.\r\nFrom Clockwork, Tag Get tagged Element - Get tagged element.\r\nUnlike the OOTB node it works also for linked element, linked room, room, space and area categories., Tag Is Orphaned - Identify the orphaned tags.\r\nOrphaned tags are tags that are associated with a linked document but  no longer have a host element., Tag Set Location - Moves the head of the tag to the given location point., Unfold Concave - Unfold curved elements like Walls or stairs.\r\nAn inner perimeter circle of the element must be drawn to intersect the geometry with it., Unfold Convex - Unfold curved elements like Walls.\r\nAn inner perimeter circle of the element must be drawn to intersect the geometry with it., Unload RevitLinkInstance - Unloads the Revit link provided.\r\nBased on a Einar Raknes's script., Unload RevitLinkType in Document - Unloads all Revit links in a document Revit.\r\nBased on a Ben Osborne's script., View Get Color of Filter - Note: This method is deprecated in Revit 2019.\r\nGet the view filter and its colors from the given view., View Properties - Returns certain properties of given views. , View Range - Get the view range of a plan view or a plan region.\r\nReturns the View Range Levels and the Offset values., Wall CompoundStructureLayersLocation - Get the wall layers location lines., Wall Layer References - Gets the references of the wall layers. (Wall's centerline, center of core, and faces of core), Create Compound System FamilyType - Creates a new compound wall, floor, roof or ceiling Type and assigns material, width and function., Element Pattern Reference - Retrieves Top Surface, top Material, top Fill Pattern and its references of a roof, floor or ceiling.\r\nThese references can then be used to dimension the FillPattern., Element to Document - Returns the Document in which the Element resides, the document's filename and filepath., Element Top and Bottom References - Retrieves Top and Bottom Surfaces, Materials, and references of a roof, floor or ceiling., Get SystemType Properties - Returns the Mechanical or Piping System Type, the system classification, the abbreviation, the system line weight, color, pattern and the system material., Select Point on Element - Select the point(s) on the face(s) and get the reference(s)., Set SketchPlane By Line - Works only in Revit 2016 and later.\r\nSelects a line, constructs a plane and assigns the sketch plane to the active view. \r\nAn active sketch plane is required for model curve creation.","engine_version":"2.0.2.6833","engine":"dynamo","engine_metadata":"","site_url":"https://forum.dynamobim.com/u/Alban_de_Chasteigner","repository_url":"","contains_binaries":true,"node_libraries":["Package.customization, Version=0.0.0.0, Culture=neutral, PublicKeyToken=null"]}