{"license":"MIT","file_hash":null,"name":"SteamNodes","version":"1.2.3","description":"A set of various nodes to implement a Dynamo workflow in your job. contact: @jbenoit44","group":"","keywords":["steamnodes","bad","monkeys"],"dependencies":[],"contents":"Analytical.CreateLineBoundaryCondition - Create Line Boundary Condition from Analytical Line, Analytical.CreateLineLoadBeta - beta 1, Area.CreateAtPoint - create Area from center points at Level, Area.CreateAtUV - create Area from center points at Level, Area.CreateFromPlanCircuit - Place new Areas in Plan Circuit, Element.3DCropViewTopBaseOffset - create 3d view for each element and crop view, Element.Create 3D Cropped view - create 3d view for each element and crop view, Element.GetFromLinkedFile - Get elements from link document instance based on category, Element.GetParts - Get parts for the elements from Input. Returns Parts and Parent elements, Element.IsTagged - Checks if all Elements are tagged in the project, Element.MakeParts - Create Parts from valid elements, Element.SelectInView - Select the input elements in active view. Disconnect / Connect to refresh., Element.TypeName - Get Type Name as string, List.FilterByString - Filter a list by a string match, List.Operations - List A-B / List Intersection / List symmetric difference, List.SortByFunctionGetNmaxvalues - Get N max values from a sorted list, Parts.ElementsAreValidToCreateParts - Filter Elements to create Parts from, Parts.Genealogy - Get Parent, Childs and PartMaker for any Part, Parts.Getparents - Returns parents of selected Parts, Parts.IsFromLinkedElement - Check if Parts are derived from linked elements, PointCloud.GetPointsFromBoxSelection - WIP: collects the points from a point cloud instance by using a box shape collector (aka a Revit element such as a Mass). Mass geometry has to be a box (parallel faces).\r\nThe number of points read must range from 1 to 1000000. Default 50000.\r\nAverage Distance is a setting for PC density. Less distance increases the number of points.\r\n, Schedule.GetCalculatedValues - Get Schedule Calculated Values from name input, Schedule.GetTextFromHeader - from Viewschedule input, returns columns header values as text, Tool.AddVoidCut - Add void cut for a Set of elements. In combination with Get surrounding elements node., Tool.AlignSheetViewsFromTemplateSheet - Align views and schedules from a sheet template, Tool.AssemblyViews - Create Sheet and Views for Assembly instances, Tool.CreateAssembly - Create an Assembly for each element, Tool.CreateEmptySheet - Add the amount of sheets from titleblock type. numbers and names are set from lists, Tool.CreateRoomAtPointAndLevel - create rooms from center points at Level, Tool.CropViewFromRoomShapeWithOffset - Crop the floor plan view according to the room shape with an offset value., Tool.ElementsInGroup - returns elements from a given group, selected by his name, Tool.Eraser - Try to delete any element from project, Tool.EraserByName - erase things in a list, selected by the name, Tool.ExportDWF - Export Views to DWF file, Tool.GetFillPatternTarget - Returns the target (drafting-model-none) from a FillPatternElement, Tool.GetLineStyleByName - Collects LineStyle from string.contains, Tool.GetPhaseByName - Get Document Phases by String, Tool.GetRevitSelection - Get the selection from the Revit UI, use boolean action to refresh when selection must be updated, Tool.GetSurroundingElements - Get Surrounding Elements by Categories, group them  as  List. Tolerance distance available., Tool.IntersectionChecker - Checks if elements have a geometrical intersection. The result is a list of list, with First Element is checked against the others., Tool.PhysicalBeamToAnalytical - **MANUAL MODE ONLY**\r\nMove Physical Beam to his Analytical model location, Tool.PlaceGroupAtPoint - place a given group at given points, Tool.PlaceViewsOnExistingSheets - Place the views on the sheets at the points you provide., Tool.PlaceViewsOnSheets - Places existing views on existing sheets, Tool.PointComponents - X Y Z of points, Tool.RemoveVoidCut - Add void cut for a Set of elements. In combination with Get surrounding elements node., Tool.RenameAssembly - Rename Existing Assembly - doesn't work yet at Assembly creation (transaction related, WIP)\r\nBeware: same length Lists, Tool.RunMe - Use Boolean to perform an action, Tool.Toggle - Offers 2 ways for output, Tool.UnusedTypes - collects unused types in model before deletion, Tool.UpdateString - Replace a Parameter string value by another one, Tool.WeightedAverage - Calculate Weigted Average of 2 lists, View.ApplyViewTemplate - Applies a view template to any given view(s). Supply a string with a view template name., View.CropView - Crop a 3D view, View.GetViewport - Get Vieworts from Views, View.ViewPortBoxCenter - Get ViewPort Box center point, Viewport.SetBoxCenter - API class, ViewSchedule.GetColumnWidth - ViewSchedule.GetColumnWidth, ViewSchedule.SetColumnWidth - ViewSchedule.SetColumnWidth, Wall.GetTotalWidth - Get Wall's  Total Width parameter","engine_version":"1.2.1.3083","engine":"dynamo","engine_metadata":"","site_url":"https://aecuandme.wordpress.com/","repository_url":"","contains_binaries":false,"node_libraries":[]}