{"license":"MIT","file_hash":null,"name":"spring nodes","version":"110.0.2","description":"Spring Nodes focuses on enhancing Dynamo's interaction with Revit and exploring any means that can help accelerate BIM work-flows. Your recommendations and ideas on how to improve things are always welcome. For more information and sample files, be sure to check out the repository:\r\nhttps://github.com/dimven/SpringNodes\r\ntwitter: @5devene\r\n\r\nPlease report any issues directly to the GitHub repository.\r\n","group":"Springs","keywords":["springs","spring","api","revit","design","script","bad","monkey","opening"],"dependencies":[],"contents":"Springs.AdaptiveFamily.ByFacetedGeometry - Genearate a new eight point adaptive component family type from any solid or polysurface consisting of planar faces. Faces with openigs are not supported., Springs.AreaPlan.ByLevelName - Creates an area plan at the designated levels. Each new view needs a name. An area scheme must first be activated before it can be used. To activate a scheme, place one view of that type in the project(you can then delete it).  If a view with the same scheme and name exists, you'll get a null instead., Springs.Beams.FixExtents - Detects all beams from the input list with broken extents(actual length - cut length <  margin) and attemts to correct them., Springs.BoundingBox.MidPoint - Fetches the mid point of the bounding box., Springs.BoundingBox.Scale - Scales the bounding box in three dimensions according to it's center., Springs.BrepShape.ByGeometry - Convert the input geometry to DirectShape element inside the Revit document.  Works only in Revit 2017 and later. Usies the more advanced BrepBuilder. It supports solids or surfaces, however periodic faces like spheres, cylinders and cones are not supported. Each created DS will have a unique type. Make sure that each input geometry has a unique name. You can either feed a single category and material for all geometries or a unique one for each geometry - the node's lacing is set to longest by default. The default category is Generic Model., Springs.ClosedCurve.Offset+ - Offsets a curve both ways and correctly differenciates the external and internal offset. If an offset goes beyond the curve's bounds, the result will fail and a null value will be appended instead. Also works for convex curves like arcs., Springs.Collector.CurrentSelection - Gets the currently selected elements. Connect a boolean switch to refresh the selection., Springs.Collector.ElementsInView - Selects all elements visible in the input view., Springs.Collector.ElementSketch - Get the actual sketch lines of a sketch based element (floor, ceiling, modified wall, etc.) . You can optionally fetch the matching model curves, however this might prove comptationally heavy on larger data sets., Springs.Collector.FamilyInstances - Collects placed family instance elements from the document that match the name. Partially mathing elements are collected as well. If no matches are found, a list of all isntance names will be output., Springs.Collector.FamilyTypes - Collects non-system family types that fully match or partially match the provided names. If no matches are found, a list of all type names will be output., Springs.Collector.FloorTypes - Collects Floor types by name., Springs.Collector.LinkedInstanceElements - Extract elements by category from the selected linked instances. The transform vector can be used to get the exact location of the elements in the local file, Springs.Collector.Revisions - Collects all revision clouds from a specific date., Springs.Collector.Sheets - Search for sheets by either their name or their number. Use a false boolean switch to search by number., Springs.Collector.Views - Search for views based on naming. You can choose to either include or exclude schedules. Use the sheet collector for sheets., Springs.Collector.WallTypes - Collects wall types by name., Springs.Color2Decimal - Converts a Dynamo colour its Revit equivalent  decimal value., Springs.Curve.Offset+ - Offsets a curve towards the specified point, Springs.CurveLoop.Simplify - Attempts to simplify an open or a closed curve loop by connecting straight separate line segments into a single line., Springs.Decimal2Color - Converts a revit colour decimal value to its Dynamo equivalent., Springs.Dictionary.ByKeysValues - Dictionaries are an incredibly powerful tool for making associative sets between two equal length lists. The first list must be of unique strings (or numbers) and will be the key and the second list will be the matching values (it can be made up of geometry, elements, even other lists)\r\nThe search keys list will provide the corresponding value to the input key., Springs.DirectShape.ByGeometry - Convert the input geometry to DirectShape element inside the Revit document.  It supports solids or surfaces.It is based on an alternative process that uses a SAT import and can produce smooth surfaces. Each created DS will have a unique type. Make sure that each input geometry has a unique name. You can either feed a single category for all geometries or a unique category for each geometry - the node's lacing is set to longest by default., Springs.DirectShape.Transform - Transforms the typed DirectShape element from the identity coordinate system to the input coordinate system(s), in a manner similar to Dynamo's Geometry.Transform node., Springs.DirectShape.Translate - Copy the input DirectShape element with the help of a translation vector, similarly to the Geometry.Translate node. This method should prove more efficient than Element.Copy, Springs.Doc.ActiveView - Selects the current document's active view. Supports more view types than the built-in option.\r\nWill be depreciated once the bult in node works with all plan types., Springs.Doc.DeleteElements - Attempts to delete the input list of elements from the active Revit document.The node returns the number of successfully deleted elements and their Ids as a string. Carefully observe the deleted elements count. It may be greater than the input list because hosted elements or tags will be deleted as well. If an element in the list can not be deleted (for example last revision or last view), the whole list will fail to be deleted., Springs.Element.IsCut - Tests if the element is being cut by any void instances. If any cuts exist all cutting elements will be provided., Springs.Element.IsCutting - Tests if the input element (or elements) is a void cut and if it is cutting any elements. In such cases, the cut elements will be provided., Springs.Element.RemoveVoidCut - Removes the void cut between the input elements, if such exists., Springs.Element.SetLocation - Attempts to modify the location of the input element. This can effectively add as a move comand in Revit. Works for both line based and point based elements., Springs.ElementsOfCategory - Same as the built in \"All Elements of Category\" but can act as a function object and does not get refreshed automatically., Springs.ElementType.Duplicate - Create duplicate element types. If the type exists, it will be appended instead., Springs.ErrorReport.Parse - Process a Revit error report (HTML file) and extract the error types, all affected elements and the total number of errors. If you are executing from a document different than the one the error report belongs to, be sure to set \"fetch_elements\" to false., Springs.FamilyInstance.ByFacePoints - Places instances on the input face oriented to the face's U tangent and the global Z axis., Springs.FamilyInstance.ByGeometry - You must provide a valid family template path that will be used for all input geometry objects. The project units(and not the templates) will be used to determine the size of the output geometry.\r\nThe provided category will be used only if the family template supports it. If not, the default template category will be used instead.\r\nLikewise, the family material(provided as a string) will be set only if a material with that name exists in the template. If not, the default material will be used instead (\"By Category\").\r\nFor void cuts, the material settings will be ignored.\r\nThe Subcategory name is an optional input. If you'd like to skip assigning a Subcategory to any new instance, simply use null.\r\nThe node expects a unique family name for each geometry object. The rest of the input lists will be processed as if the node lacing is set to longest., Springs.Feet2Fraction - Converts a decimal foot value to a fractional foot/inch string., Springs.File.Size - Checks the file size. Provide a file path as a string., Springs.Filter.ByCategoryName - Filters the input elements by their category name. You can input multiple category names., Springs.Filter.ByClassName - Filters a list of objects by the object's class name. Note that Dynamo elements belong to different classes than their Revit counterparts. Use the Object.Class node to check an object's class., Springs.Filter.BySelection - Check the items that you'd like to filter in.  Unchecked items will be sent to the out list. The optional names input will override the object representation., Springs.FloorOpening.ByCurves - Create hosted floor opeinngs through the input floors. The second input is a list of sub-lists of the boundary curves., Springs.Form.ByGeometry - Convert the input geometry to a Revit Form object. Forms can exist only in the family environment. You can convert complicated solids or surfaces directly into forms. A form can act as a void. Provide either one true boolean value to convert a form into a void. The node's lacing is set to longest by default., Springs.Fraction2Feet - Converts a fractioned feet /inch string value into a decimal foot value., Springs.Geometry.Extents - Gets the dimensions of the geometry's bounding box., Springs.Geometry.GroupByDistance - Splits the list of curves into groups if the distance between them is lesser than the provided margin., Springs.Geometry.SplitRecursively - Splits a surface or a solid recursively, using the resulting reduced geometry for every consecutive split. Select a point or another geometry to control the direction of the split., Springs.HostedInstance.ByPoints - Creates hosted family instances(doors/windows) at the specified points. You can feed either a single family type or a unique type for each instance., Springs.InterferenceCheck.Parse - Process a Revit interference check (HTML file) and extract the interference categories, all affected elements and the total number of clashes. If you are executing from a document different than the one the error report belongs to, be sure to set \"fetch_elements\" to false., Springs.Line.StraightenXY - Checks a line's end points for irregularities and corrects them if they are at or below the specified margin. The default margin is 1/5000 of the curve length, which is conservative., Springs.Line.StraightenZ - Checks a line's end points for irregularities in  the Z axis and corrects them if they are at or below the specified margin. The default margin is 1/2000 of the curve length, which is conservative., Springs.LineLoop.Merge - Attempts to join lines into a single chain of joined curves. The node returns the new lines as a chain and with the original order. The success outputs returns the success of the execution as a true/false boolean., Springs.List.DragDropReorder - Press and hold on an item to move it up or down the list. To confirm and close the window, select \"Save Order\". The optional names input will override the object representation., Springs.List.DropDown - Selects one list item by a drop-down combo box. The optional names input will override the object representation., Springs.List.DropFirstLast - Removes the first and last items from the list, Springs.List.EveryOther - Useful for when you want to combine an item on the list with every other item on the list. For example in list {1,2,3} , \"2\" will be paired up only with \"1\" and \"3\" and will not be paired up with itself., Springs.List.GetEvenOdd - Gets even indices from the list., Springs.List.MergeByBoolMask - Merge two lists by a boolean mask list. The true count in the mask should be the same as the length of the true list and vice versa for the false list., Springs.List.Randomise&Divide - Shiffles the input list and divides it into sub-lists based on ratios(1/4 + 1/2 + 1/4 will give you three lists split accordingly) The smalest ratio will always be 1 / the list length and the largest ratio will be 1. A seed input can shuffle the list further., Springs.List.Split - Splits a list at the desired length, Springs.List.Subpairs - Pair up each list item with the next one and drop the list item., Springs.Ln2Str - Serilize a geometry line to a string for use in Revit parameters, Springs.Math.AlmostEqual - Checks if a number is almost equal to a value with a specified tollerance., Springs.Mesh.ToPolySurface - Converts a Dynamo mesh to a polysurface. Uses multithreading - optimized for 4 cores., Springs.Mesh.ToToolkitMesh - Converts a Dynamo mesh to a toolkit mesh. You obviously need to have the appropriate version of the mesh toolkit package downloaded first., Springs.N-hedron.ByOriginVector - Creates a multi-sided poyhedron with defined side length and total height., Springs.NullAllIndicesOf - list all of the indices of a list that match the specified value. Capable of handling null values, part of the SmartCopyMonitor workflow., Springs.NullGetParameter - Similar to the built in node.Capable of handling null values, part of the SmartCopyMonitor workflow., Springs.NullIndexOf - Similar to the bult-in node but provides a null value instead of -1 of failure. Part of the SmartCopyMonitor workflow., Springs.NullReorder - Simiar to the built-in function with the difference that it can handle null indices. Part of the SmartCopyMonitor workflow., Springs.NullSetDifference - Similar to the built in node, with a built-in safety for null values. Part of the SmartCopyMonitor workflow., Springs.NullSetParameter - Similar to the built-in function but with the ability to handle null values. Part of the SmartCopyMon workflow., Springs.Number.ToString - Converts the input number(s) to string. Can process lists., Springs.PlanarFace.FixDomain - Corrects the surface domain of a 3 or 4 point planar face extracted from Revit., Springs.Point.PullOntoPlane - Pulls (projects) the point onto the input plane, following the plane normal., Springs.Points.ConvexHull2D - Computes the XY convex hull of a given set of points based on the monotone chain algorithm., Springs.PolyCurve.Chamfer - Symmetrically chamfers the corners of the polycurve by the designated distance, Springs.Polygon.ContainmentTest+ - A less accurate method that should perform faster than the built-in node for large data sets., Springs.Pt2Str - Serilize a geometry point to a string for use in Revit parameters, Springs.SelectEdges - Select multiple edges from inside the Revit UI. Be sure to press \"Finish\" once done. You can use a Boolean toggle to refresh your selection., Springs.SelectElements(ordered) - Select multiple elements from the Revit document in the desired order. Hit ESC to stop picking. To refresh the node, connect a boolean switch node., Springs.SelectFaces+ - Select multiple faces from inside the Revit UI. Be sure to press \"Finish\" once done. Unlike the built-in node, face references of instances will be added sucessfully and you'l get the pick points. You can use a Boolean toggle to refresh your selection., Springs.SelectInRevit - Selects the input elements inside the Revit UI., Springs.SelectLinkedElement - Select the linked instance first, followed by the element. If your selection fails, just press escape.\r\nTo refresh the node, connect a boolean switch node., Springs.SelectLinkedElements(ordered) - Select the linked instance first. Then select multiple elements from the Revit document in the desired order. Hit ESC to stop picking. To refresh the node, connect a boolean switch node., Springs.SelectLinkedElements - Select the linked instance first, followed by the elements. To finish the selection, press Finish. If your selection fails, just press escape or Cancel.\r\nTo refresh the node, connect a boolean switch node., Springs.SelectLinkedFace - Select the linked instance first, followed by the face. If your selection fails, just press escape.\r\nTo refresh the node, connect a boolean switch node., Springs.Shaft.ByCurves - Creates a shaft opening. The top level MUST be higher than the base level for a successful execution. You can either provide one base and top level for all shafts or have unique levels for each shaft instance., Springs.Sheet.Views+ - Extracts all views and schedules (minus the revision schedule) placed on the input sheet (or sheets).\r\nWill be depreciated once the bult in node works with all plan types., Springs.Star.ByCenterRadiusRays - Fun little node to create star shapes., Springs.Str2Ln - De-serilize a Revit parameter string into a geometric line., Springs.Str2Pt - De-serilize a Revit parameter string into a geometric point., Springs.ViewSet.ByViewsName - Creates a set of views(or sheets) for printing. If the set exists, set Overwrite to true to replace it., Springs.Watch+ - This node that serializes the input information and presents it in a resizable text window.","engine_version":"1.1.0.2094","engine":"dynamo","engine_metadata":"","site_url":"http://dynamonodes.com/2016/01/28/spring-nodes-node-index/","repository_url":"https://github.com/dimven/SpringNodes","contains_binaries":false,"node_libraries":[]}