{"license":"http://provingground.io/tools/lunchbox/","file_hash":null,"name":"LunchBox for Dynamo","version":"2016.11.11","description":"**Built for Dynamo 1.2 (Revit 2015 + 2016)** LunchBox is a collection of reusable geometry and data management nodes.  The tools have been tested with Dynamo 1.0 and Revit 2016.  The tool includes nodes for surface paneling, geometry, Revit data collection, and more!.  After installation, search a 'LunchBox' category will appear in Dynamo.  For versions compatible with Dynamo 0.6, please install version 2014.6.5 or earlier.  For more information, visit http://provingground.io/tools/lunchbox/","group":"Proving Ground","keywords":["parametric","math","curtain","panels","xyz","domain","numbers","random","json","xml","excel","revit","collector"],"dependencies":[],"contents":"LunchBox Adaptive Component Collector - Gets a list of Adaptive Components from a document using the Family Name., LunchBox Area Element Collector - Collects rooms from the Revit document, LunchBox AreaPlan Element Collector - Collects AreaPlans from the Revit model, LunchBox Attractor Wave - Generates a wave attractor effect using lists of attractors and targets., LunchBox Attractor - Simple distance-based attractor calculation, LunchBox Braced Grid Structure 2D - Creates a braced grid 2D on a surface., LunchBox Braced Grid Stucture 1D - Creates a 1D braced grid structure on a surface, LunchBox Create Room by Name and Number - Creates an unplaced room element using a name and number., LunchBox Curtain Panel Collector - Collects curtain panel instances and references them., LunchBox Curve to Arcs by Division - Converts a curve to tangent arc segments, LunchBox Curve to Arcs by Parameters - Converts a curve to arcs using parameter values, LunchBox Deconstruct Face - Gets the edges and vertices of a face., LunchBox Deconstruct Solid - Deconstructs a Revit solid into faces, edges, and vertices, LunchBox Diagrid Structure - Creates a diagrid structure on a surface., LunchBox Diamond Grid by Face - Create a Diamond XYZ grid on a face.  The face surface must have an untrimmed UV parameter space., LunchBox Domain Variables - Gets the Min and Max variables of a Domain., LunchBox Family Instance Collector - Collects Family Instances from the Revit Doc, LunchBox Floor Element Collector - Collects Floor elements from the current Revit document., LunchBox Get Domain - Gets the domain from a list of numbers., LunchBox Get Parameter Value - Gets parameter values from a Revit element., LunchBox Grid Element Collector - Collects Revit Grids from the current Revit document, LunchBox Grid Structure - Creates a grid wireframe on a surface., LunchBox Helicoid - Creates a parametric Helicoid surface, LunchBox Isovist - Isovist Ray Generation, LunchBox Level Element Collector - Collects Levels from the current Level document, LunchBox List Matcher - Compares a List A against a List B and matches length of List A.  If ListA > ListB, ListB will be extended.  If ListA < ListB, ListB will be truncated., LunchBox Mass Addition - Returns the total value of a list of numbers., LunchBox Mass Multiplication - Returns the total value of a list of numbers., LunchBox MEP Space Collector - Collects MEP Spaces and properties, LunchBox Mobius - Creates a parametric mobius surface., LunchBox Paraboloid - Creates a parametric Hyperbolic Paraboloid surface, LunchBox Placed and Unplaced Rooms - Finds placed and unplaced rooms, LunchBox Planarize Points - Projects a list of a 4 or more points to a common plane., LunchBox Point to String - Converts Point objects to strings., LunchBox Quad Grid by Face - Create a quadrangular XYZ grid on a face.  The face surface must have an untrimmed UV parameter space., LunchBox Random Numbers - Generates a list of Random numbers using a domain, amount, and seed., LunchBox Random Split List - Randomly splits a list of objects into two separate lists., LunchBox Remap Numbers - Remaps a list of numbers to a new domain., LunchBox Remove Null Values - Remove 'null' values from a list., LunchBox Room Element Collector - Collects rooms from the Revit document, LunchBox Sheet Collector - Collects sheets from the current document, WireSpaceTruss - Create a space truss using a surface., LunchBox Staggered Grid by Face  - Create a Staggered XYZ grid on a face.  The face surface must have an untrimmed UV parameter space., LunchBox String to Point - Converts a point string \"x,y,z\" into a true Point., LunchBox Structural Framing Collector - Collects Structural Graming Families from the Revit document., LunchBox Torus - Creates a parametric Torus surface, LunchBox Triangle Grid by Face - Create a Triangular XYZ grid on a face.  The face surface must have an untrimmed UV parameter space., LunchBox Vector Amplitude - Set the amplitude of a vector., LunchBox Vector Angle - Computes the angle between two vectors., LunchBox View Element Collector - Collects views from the active Revit document., LunchBox Wall Element Collector - Collects wall elements from the Revit document., LunchBox Wave - Creates a parametric Wave surface","engine_version":"1.2.0.2690","engine":"dynamo","engine_metadata":"","site_url":"http://provingground.io/tools/lunchbox/","repository_url":"","contains_binaries":true,"node_libraries":["LunchBox, Version=2016.10.24.0, Culture=neutral, PublicKeyToken=null"]}