{"license":"MIT","file_hash":null,"name":"bimorphNodes","version":"3.0.3","description":"BimorphNodes are a collection of powerful utility nodes that extend Dynamo for Revit.\r\n\r\nThe package includes ultra-efficient clash detection and geometry intersection nodes, which are enabling entirely  new workflows in Dynamo and Revit by reducing processing time by up to 99.7% compared to any other method. The  new clash and containment checking nodes can be found in the BoundingBox and Element node classes.\r\n\r\nBimorphNodes extends Dynamos Revit.Elements.Element class with the exclusive LinkElement nodes, which comprise a range of methods that enable collection and interaction of elements from linked Revit models. The LinkElement class has been purpose-built to solve the transform limitation imposed by the Revit API, which restricts elements to their origin-to-origin position regardless of any transforms made to the associated link instance. LinkElement's have no such restriction, and are designed to position elements at their host location by default.\r\n \r\nFor DWG/DGN interop in Revit, there are nodes which convert text from CAD layers without exploding, which until now has been the only way to 'import' text entities from CAD into Revit. BimorphNodes is the first and only package to provide this unique functionality. Whatsmore, as the file is not exploded, there is no need to pre-process the file nor is the node limited to Revit's 10,000 element threshold. The node works recursively too, so if your file contains nested blocks with text, it will be converted regardless of the nested depth.\r\n\r\nOther CAD nodes provide the ability to convert points or curves from CAD links or imports using Layer Names as filters. Curves can be converted to Dynamo Proto Curves, or Revit Model, Detail or Symbolic curves. The CAD file is parsed on memory without exploding the instance, so unwanted CAD LineStyles or elements will never enter your project. Finally, for enhanced workflows, each set of curves can be mapped to a LineStyle using the lineStyleMap input.\r\n \r\nThese CurveFromCADLayer nodes are optimised to convert more curve types than is  currently possible with Explode in Revit or Revit.Elements.Element.Curves in Dynamo.\r\n \r\nThere are also nodes to duplicate sheets and any placed views, and new geometry nodes which extend Dynamos Curve class with new entirely functionality.\r\n \r\nPackage Nodes:\r\nCLASH DETECTION & ELEMENT CONTAINMENT\r\n - Element intersection (clash detection) with other elements - optimised for rapid results with massive datasets\r\n - Element intersection with Dynamo Solids - also optimised for rapid results\r\n - Get all elements inside or intersecting a Bounding box (implements a Revit ElementQuickFilter for speed)\r\n \r\nCAD\r\n - Extract text from CAD links or imports using layers as filters\r\n - Extract points or curves from CAD Links or Imports using layers as filters\r\n - Extract Detail curves from CAD Links or Imports using layers as filters\r\n - Extract Symbolic curves from CAD Links or Imports using layers as filters\r\n - Query layers in CAD Links or Imports\r\n - Report all CAD Links and Imports in a Revit or Family document\r\n - Set the colour and line weight of CAD (layer) Object Styles\r\n \r\nLINKELEMENT\r\n - Collect elements from a linked Revit model by category or ray bounce\r\n - Solves the linked element transform limitation imposed by the Revit API\r\n - LinkElements are located at their host location by default\r\n - Query the link elements associated transform and link instance ID\r\n - Get the link elements geometry and location at its host location\r\n - Get parameter values from LinkElements\r\n - Optimised for use with BimorphNodes BoundingBox and Element nodes\r\n \r\nSHEET\r\n - Duplicate Sheets and placed Views\r\n - Renumber and/or rename Sheets\r\n - Get sheets from a Revit Sheet List schedule\r\n \r\nCURVE\r\n - Remove duplicate curves\r\n - Find all intersections between a set of curves (optimised)\r\n - Intersect a curve with a solid (optimised)\r\n \r\nSCHEDULE\r\n - Extract table data from Schedules \r\n \r\nLINESTYLE\r\n - Create and query LineStyles\r\n \r\n Compatible with Revit 2016-2020 and Dynamo v1.2 to v2.1.\r\n \r\n Get the latest BimorphNodes news by following us:\r\n \r\nLinkedIn:  linkedin.com/company/bimorph-bim\r\nFacebook:  facebook.com/bimorphBIM\r\nTwitter:  @bimorphBIM\r\nNode dictionary: bimorph.com/bimorph-nodes","group":"","keywords":["bimorph","cad","duplicate","sheets","linkelement","clash","intersection","cadtextdata","schedule","curvesfromcadlayers"],"dependencies":[],"contents":"","engine_version":"1.3.4.6666","engine":"dynamo","engine_metadata":"","site_url":"https://bimorph.com","repository_url":"","contains_binaries":true,"node_libraries":["BimorphNodes, Version=3.0.3.0, Culture=neutral, PublicKeyToken=null"]}